package HW;

public class HW2 {
    public static void main(String[] args) {
//    Задача 1. Дано: Хитрый бухгалтер разделил 5 рублей на 2 кассы. Сколько рублей лежит в каждой кассе?
//    Вывести на косоль
/**
 int a = 5;
 int b = a / 2;
 System.out.println(b);
 */
//        Задача 2. Дано: Стороны квадрата a = 50, b = 20. Найти площадь.
//        Вывести на косоль
/**        int a = 50;
 int b = 20;
 int S = a * b;
 System.out.println("Площадь квадрата равна " +S);

 */
//        Задача 3. Дано: Голодный Вася съедает за 9 минут 3 банана, а сытый за 15 минут,
//                насколько быстрее голодный Вася съедает один банан?
//        Вывести на косоль
/**
 int t1 = 9;
 int t2 = 15;
 int banana = 3;
 int OneBananaTime = t1 / banana;
 System.out.println(OneBananaTime+ " Минуты тратит на 1 банан голодный Вася.");
 int FullVasya = t2 / banana;
 System.out.println(FullVasya+ " Минут тратит минут на 1 банан сытый Вася.");

 int TimeDifference = FullVasya - OneBananaTime;
 System.out.println("Голодный Вася съедает банан на " + TimeDifference + " минуты быстрее, чем сытый Вася.");
 */

//        Задача 4. Закомментируй часть кода, чтобы на экран вывелось сообщение "sum = 12"
/**
        int a = 3;
        //        int a = 10;
        int b = 6;
        //        int b = 12;
        //        int sum = 1 + a + b;
        //        int sum = 2 + a + b;
        int sum = 3 + a + b;
        //        int sum = 4 + a + b;


        System.out.println("sum = " + sum);
*/
    }
}
