package sam_work;

import java.util.Scanner;

public class SamWork1 {
    public static void main(String[] args) {
//        Задача 1. Дано: Хитрый бухгалтер разделил 5 рублей на 2 кассы. Сколько рублей лежит в каждой кассе?
//        Вывести на косоль

        int money = 5;
       float cassa = (float)money / 2;
        System.out.println(cassa);

//        Задача 2. Дано: Стороны квадрата a = 50, b = 20. Найти площадь.
//        Вывести на косоль

//        int hight = 50;
//                int lenght = 20;
//                int P = hight * lenght;
//        System.out.println(P);

//        1 Написать программу, чтобы она:
//        - выводил на экран строку "Число меньше 5", если число, которое мы ей подадим меньше 5,
//                - выводил строку "Число больше 5", если число, которое мы ей подадим больше 5,
//                - выводил строку "Число равно 5", если число, которое мы ей подадим равен 5.
/**
        Scanner scanner = new Scanner(System.in);
        int a = scanner.nextInt();
        if (a > 5) {
            System.out.println("Число " + a + " больше 5");
        }
        else if (a < 5) {
            System.out.println("Число " + a + " меньше 5");
        }
        else if (a == 5) {
            System.out.println("Число " + a + " равно 5");
        }
 */
//        Напиши программу. которая будет проверять попало ли целое число, которое мы ей подадим
//        в интервал от 50 до 100 и сообщить результат на экран в следующем виде:
//        "Число number не содержится в интервале." или "Число number содержится в интервале.", где number - число, которое мы ей подадим.
//                Пример для числа 112:
//        Число 112 не содержится в интервале.
//
//        Пример для числа 60:
//        Число 60 содержится в интервале.

//        Scanner scanner = new Scanner(System.in);
//        int var = scanner.nextInt();
//        if (var >= 50 && var <=100 ) {
//            System.out.println("Число " + var + " содержится в интервале.");
//        }
//        else {
//            System.out.println("Число " + var + " не содержится в интервале.");

//            Ввести с клавиатуры два числа m и n.
//            Используя цикл for вывести на экран прямоугольник размером m на n из восьмёрок.
//
//
//            Пример: m=2, n=4
//            8888
//            8888


        }
    }
